DELETE FROM meals;
DELETE FROM user_roles;
DELETE FROM users;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2020-01-30 10:00:00', 'Завтрак юзер 1', '500', '100000'),
       ('2020-01-30 13:00:00', 'Обед юзер 1', '1000', '100000'),
       ('2020-01-30 20:00:00', 'Ужин юзер 1', '500', '100000'),
       ('2020-01-31 0:00:00', 'Еда на граничное значение юзер 1', '100', '100000'),
       ('2020-01-31 10:00:00', 'Завтрак юзер 1', '1000', '100000'),
       ('2020-01-31 13:00:00', 'Обед юзер 1', '500', '100000'),
       ('2020-01-31 20:00:00', 'Ужин юзер 1', '410', '100000'),
       ('2022-01-30 10:00:00', 'Завтрак админ', '600', '100001'),
       ('2022-01-30 13:00:00', 'Обед админ', '1100', '100001'),
       ('2022-01-30 20:00:00', 'Ужин админ', '600', '100001'),
       ('2022-01-31 0:00:00', 'Еда на граничное значение админ', '200', '100001'),
       ('2022-01-31 10:00:00', 'Завтрак админ', '1100', '100001'),
       ('2022-01-31 13:00:00', 'Обед админ', '600', '100001'),
       ('2022-01-31 20:00:00', 'Ужин админ', '510', '100001');
